{
  "term": "Spring",
  "year": "2009",
  "level": [
    "Undergraduate"
  ],
  "topics": [
    [
      "Health and Medicine",
      "Mental Health"
    ]
  ],
  "legacy_uid": "eeffd913-b43b-154a-8a38-d23aff17d851",
  "instructors": {
    "content": [
      "8cabf819-533f-6464-e7ad-5d2aa2e63561",
      "b120e68f-9813-f64a-0015-def2c1ae5d8c"
    ],
    "website": "ocw-www"
  },
  "course_image": {
    "content": "16f8552d-c3ed-252d-06dd-13a261c06841",
    "website": "pe-550-designing-your-life-spring-2009"
  },
  "course_title": "Designing Your Life",
  "hide_download": true,
  "course_description": "This course provides an exciting, eye-opening, and thoroughly useful inquiry into what it takes to live an extraordinary life, on your own terms. The instructors address what it takes to succeed, to be proud of your life, and to be happy in it. Participants tackle career satisfaction, money, body, vices, and relationship to themselves. They learn how to confront issues in their lives, how to live life, and how to learn from it.\n\nA short version of this course meets during the Independent Activities Period (IAP), which is a special 4-week term at MIT that runs from the first week of January until the end of the month. Then this semester-long extension of the IAP course is taught to interested members of the MIT community. This not-for-credit course is sponsored by the Department of Science, Technology, and Society. A similar, semester-long version of this course is taught in the Sloan Fellows Program.\n\n##### Acknowledgment\n\nThe instructors would like to thank Prof. David Mindell for his sponsorship of this course, his hopes for its continued expansion, and his commitment to the well-being of MIT students.\n",
  "department_numbers": [
    "PE"
  ],
  "extra_course_numbers": "",
  "primary_course_number": "PE.550",
  "course_image_thumbnail": {
    "content": "c2f1b52d-c758-e58f-7400-fed37984a090",
    "website": "pe-550-designing-your-life-spring-2009"
  },
  "hide_download_original": false,
  "learning_resource_types": [
    "Lecture Notes",
    "Written Assignments"
  ],
  "site_uid": "7cff8ef6-a3c1-4b8e-9ce9-ac2155fa01c5",
  "site_short_id": "pe.550-spring-2009",
  "site_url_path": "courses/pe-550-designing-your-life-spring-2009",
  "title": "Course Metadata"
}